logs/sysbench/201905/20190526_4_2/thread_02_20190526234516.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 2 tps: 1016.33 qps: 12196.39 (r/w/o: 10163.63/0.00/2032.77) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 988.23 qps: 11859.00 (r/w/o: 9882.45/0.00/1976.55) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 1026.33 qps: 12316.66 (r/w/o: 10264.00/0.00/2052.66) lat (ms,95%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 1051.57 qps: 12617.44 (r/w/o: 10514.50/0.00/2102.94) lat (ms,95%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 916.83 qps: 11002.80 (r/w/o: 9168.95/0.00/1833.85) lat (ms,95%): 3.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 875.36 qps: 10505.57 (r/w/o: 8754.84/0.00/1750.73) lat (ms,95%): 3.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            587530
        write:                           0
        other:                           117506
        total:                           705036
    transactions:                        58753  (979.07 per sec.)
    queries:                             705036 (11748.90 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0011s
    total number of events:              58753

Latency (ms):
         min:                                  1.62
         avg:                                  2.04
         max:                                 11.49
         95th percentile:                      2.61
         sum:                             119911.27

Threads fairness:
    events (avg/stddev):           29376.5000/744.50
    execution time (avg/stddev):   59.9556/0.00